Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/signing_on.html.txt.tmx
Source language: en
Languages: ga

source: • Signing on for the first time
ga: • Clárú ar an dól den chéad uair

source: If you lose your job, are made redundant, laid off or if your working hours are reduced you may qualify for a social welfare payment, either Jobseeker’s Allowance or Jobseeker’s Benefit
ga: Má chailleann tú post post, má dhéantar iomarcach tú, má dhéantar tú a leagan as nó má laghdaítear do chuid uaireanta oibre - d’fhéadfá a bheith incháilithe do Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist

source: When you apply for a jobseeker’s payment you declare that you are available for work, fit for work, genuinely seeking work but unable to find work
ga: Nuair a dhéanann tú iarratas ar íocaíocht cuardaitheora poist, tá tú ag dearbhú go bhfuil tú ar fáil don obair, oiriúnach don obair, ag lorg oibre i ndáiríre agus nach raibh tú in ann an obair a fháil go dtí seo

source: This is also known as signing on
ga: Tugtar clárú ar an dól air sin freisin

source: If you work for part of a week, you may qualify for a jobseeker's payment for the days you are unemployed
ga: Má oibríonn tú ar feadh cuid den tseachtain, is féidir go gcáileoidh tú le haghaidh íocaíocht cuardaitheora poist do na laethanta nach mbíonn tú ag obair

source: If you leave work voluntarily or as a result of misconduct, you cannot get a jobseeker’s payment for 9 weeks
ga: Má fhágann tú obair go deonach nó mar thoradh ar mhí-iompar, ní féidir leat íocaíocht cuardaitheora poist a fháil ar feadh 9 seachtaine

source: However, if you have ‘good cause’ to leave voluntarily, for example, any changes in working conditions such as a reduction in pay, harassment or abuse from your employer, you may get your payment
ga: Mar sin féin, má tá ‘cúis mhaith’ agat fágáil go deonach, mar shampla athruithe sna coinníollacha oibre cosúil le laghdú pá, ciapadh nó mí-úsáid ón bhfostóir, d’fhéadfá d’íocaíocht a fháil

source: The Deciding Officer in your local Intreo Centre or Social Welfare Branch Office will decide whether you had good cause to leave voluntarily
ga: Déanfaidh Oifigeach Cinnidh i d’Oifig Leasa Shóisialaigh Áitiúil cinneadh an bhfuil cúis mhaith agat fágáil go deonach

source: If you are self-employed you may get a jobseeker’s payment if you closed your business or the amount of work you are getting has sufficiently reduced
ga: Má tá tú féinfhostaithe, d’fhéadfá íocaíocht cuardaitheora poist a fháil má dhúnann do ghnó nó má thagann laghdú suntasach ar an méid oibre atá ar fáil

source: Find out more about self-employed people and unemployment
ga: Faigh tuilleadh eolais faoi féinfhostaíocht agus dífhostaíocht

source: The difference between Jobseeker’s Benefit and Jobseeker’s Allowance
ga: An difríocht idir Sochar Cuardaitheora Poist agus Liúntas Cuardaitheora Poist

source: To get Jobseeker’s Benefit you must have enough social insurance (PRSI) contributions
ga: Chun gur féidir leat Sochar Cuardaitheora Poist a fháil, ní mór go leor ranníocaíochtaí árachais shóisialaigh (ÁSPC) a bheith déanta agat

source: Jobseeker's Benefit rates are graduated according to earnings
ga: Tá rátaí Sochair Cuardaitheora Poist bunaithe ar thuilleamh

source: If you are affected by this, it may be of greater benefit for you to claim Jobseeker's Allowance
ga: Má théann sé sin i bhfeidhm ort, b’fhéidir gur cheart duit Liúntas Cuardaitheora Poist a éileamh

source: To get Jobseeker’s Allowance you must pass a means test
ga: Chun gur féidir leat Liúntas Cuardaitheora Poist a fháil, ní mór duit pas a fháil i dtástáil acmhainne

source: A means test is when your income is calculated to see whether it falls below a certain level
ga: Is é is tástáil acmhainne ann ná tástáil ina ndéantar d’ioncam a ríomh chun a fháil amach cé acu a thagann nó nach dtagann sé faoi bhun leibhéal áirithe

source: If it falls below a certain level you can get Jobseeker’s Allowance
ga: Má thiteann sé faoi bhun leibhéal áirithe, beidh tú i dteideal Liúntas Cuardaitheora Poist

source: You will always be assessed for Jobseeker’s Benefit first, unless you have never worked before
ga: Is do Shochar Cuardaitheora Poist a dhéanfar measúnú ort ar dtús i gcónaí, ach amháin sa chás nach raibh tú fostaithe riamh

source: When you apply for Jobseeker’s Benefit you are asked if you want to be assessed for Jobseeker’s Allowance
ga: Nuair a dhéanann tú iarratas ar Shochar Cuardaitheora Poist, cuirtear ceist ort ar mhaith leat dul faoi mheasúnú do Liúntas Cuardaitheora Poist

source: This means that if you don’t qualify for Jobseeker’s Benefit, you will not need to apply a second time to be assessed for Jobseeker’s Allowance
ga: Fágann sé sin nach mbeidh ort dara hiarratas a dhéanamh ar mheasúnú do Liúntas Cuardaitheora Poist mura gcáilíonn tú do Shochar Cuardaitheora Poist

source: Intreo - the integrated employment andsupport service
ga: Intreo - an tseirbhís chomhtháite fostaíochta agus tacaíochta

source: Department of Social Protection (DSP) social welfare local offices and employment services offices have been rebranded as Intreo Centres
ga: Rinneadh a lán oifigí áitiúla leasa shóisialaigh agus oifigí seirbhísí fostaíochta de chuid na Roinne Coimirce Sóisialaí (RCS) a athbhrandáil ina n-ionaid Intreo

source: Intreo provides a one-stop shop for employment services and income supports with a range of personalised supports to jobseekers including:
ga: Is é is Intreo ann ná ionad uileghnó do sheirbhísí fostaíochta agus do thacaíochtaí ioncaim. Cuireann sé raon tacaíochtaí pearsantaithe ar fáil do chuardaitheoirí poist, lena n-áirítear:

source: • Information on all the income supports provided by the Department of Social Protection, for example, jobseeker’s payments, back to work and back to education payments, one-parent family payments and pensions
ga: • Faisnéis ar gach ceann de na tacaíochtaí ioncaim a thugann an Roinn Coimirce Sóisialaí, mar shampla, íocaíochtaí cuardaitheora poist, íocaíochtaí filleadh ar an obair agus filleadh ar an oideachas, íocaíochtaí teaghlaigh aon tuismitheora agus pinsin

source: • Help and advice on employment, training and personal development opportunities
ga: • Cúnamh agus comhairle maidir le deiseanna fostaíochta, oiliúna agus forbartha pearsanta

source: • Personalised support to help you enter the workforce
ga: • Tacaíocht phearsantaithe chun cabhrú leat dul isteach sa lucht saothair

source: • Self-service facilities with information and guidance on employment and training opportunities
ga: • Áiseanna féinseirbhíse, mar aon le faisnéis agus treoir maidir le deiseanna fostaíochta agus oiliúna

source: • Information on job vacancies through jobsireland.ie
ga: • Faisnéis ar fholúntais phoist trí jobsireland.ie

source: Details of Intreo Centre locations are published on welfare.ie
ga: Beidh Intreo ar fáil i ngach oifig faoi dheireadh na bliana 2014

source: Signing on for the first time
ga: Clárú ar an dól den chéad uair

source: To sign on you must go to your local Intreo Centre or Social Welfare Branch Office
ga: Chun clárú ar an dól, ní mór duit dul chuig d’oifig áitiúil leasa shóisialaigh nó chuig ionad áitiúil Intreo

source: If you are visiting an Intreo centre you should go to the reception area
ga: Má tá tú ag tabhairt cuairt ar ionad Intreo, ba cheart duit dul chuig an limistéar fáiltithe

source: You will be met by DSP staff who will check your eligibility for a jobseeker’s payment
ga: Buailfidh tú le ball foirne RCS, duine a sheiceálfaidh do cháilitheacht le haghaidh íocaíocht cuardaitheora poist

source: They will arrange an appointment for you to have your claim processed (within a few days), give you the application form and tell you what documents you need to bring to your appointment
ga: Eagrófar coinne duit chun gur féidir d’éileamh a phróiseáil (laistigh de chúpla lá), tabharfar an fhoirm iarratais duit agus inseofar duit cad iad na doiciméid nach mór duit a thabhairt leat chuig an gcoinne

source: You can submit your application for a jobseeker’s payment online in certain locations
ga: Is féidir leat d’iarratas ar íocaíocht cuardaitheora poist a chur isteach ar líne i láithreacha áirithe

source: You should bring your completed application form and all other required documents to your appointment
ga: Ba cheart duit d’fhoirm iarratais chomhlánaithe agus gach doiciméad eile atá riachtanach a thabhairt leat chuig do choinne

source: At your appointment, a DSP Deciding Officer will review and process your application
ga: Ag do choinne, déanfaidh Oifigeach Breithiúnachta RCS d’iarratas a athbhreithniú agus a phróiseáil

source: In many cases a decision on your jobseeker’s payment can be made immediately
ga: I mórán cásanna, is féidir cinneadh láithreach a dhéanamh ar d’íocaíocht cuardaitheora poist

source: You will be asked to sign a Record of Mutual Commitments (pdf) which explains your rights and responsibilities while you are getting a jobseeker’s payment
ga: Iarrfar ort Taifead Gealltanas Frithpháirteach (pdf) a shíniú, rud ina mínítear na cearta atá agat agus na dualgais atá ort le linn duit íocaíocht cuardaitheora poist a fháil

source: Under the Record of Mutual Commitments you are expected to:
ga: Faoi Thaifead na nGealltanas Frithpháirteach, táthar ag súil go ndéanfaidh tú na nithe seo a leanas:

source: □ Co-operate with the Intreo service in developing a Personal Progression Plan
ga: □ Comhoibriú le seirbhís Intreo maidir le Plean Dul Chun Cinn Pearsanta a chur le chéile

source: □ Use this plan to do your best to secure employment
ga: □ An plean sin a úsáid chun do dhícheall a dhéanamh fostaíocht a fháil

source: □ Attend all meetings requested by the Department
ga: □ Freastal ar gach cruinniú a iarrann an Roinn

source: □ Provide all information requested by the Department
ga: □ An fhaisnéis ar fad a iarrann an Roinn a sholáthar

source: You will be issued with a Public Services card (this involves having your photo taken and your signature digitally captured)
ga: Eiseofar cárta Seirbhísí Poiblí duit (is é atá i gceist leis sin go nglacfar grianghraf díot agus go ngabhfar leagan digiteach de do shíniú)

source: All jobseekers have to register for a Public Services card if they have not been issued with one already
ga: Ní mór do gach cuardaitheoir poist clárú do chárta Seirbhísí Poiblí mura bhfuil ceann faighte acu cheana féin

source: You will also be given details of a group information session that you must attend
ga: Tabharfar sonraí duit freisin faoi sheisiún faisnéise grúpa nach mór duit freastal air

source: At this information session, you will be told about the full range of support services available from Intreo, including income, training/education and employment supports
ga: Ag an seisiún faisnéise sin, tabharfar fógra duit faoi raon iomlán na seirbhísí tacaíochta atá ar fáil ó Intreo, lena n-áirítear tacaíochtaí ioncaim, tacaíochtaí oiliúna/oideachais agus tacaíochtaí fostaíochta

source: Depending on your personal profile, you may be given an appointment for a further meeting with a DSP case officer
ga: Ag brath ar do phróifíl phearsanta, is féidir go dtabharfar coinne duit le haghaidh cruinniú eile le cásoifigeach RCS

source: At this meeting your case officer will discuss your options with you and agree your Personal Progression Plan to prepare you to find employment
ga: Ag an gcruinniú sin, pléifidh an cásoifigeach na roghanna atá agat agus aontóidh sé do Phlean Dul Chun Cinn Pearsanta leat chun tú a ullmhú do phost a fháil

source: You will get ongoing advice and support to help you meet the goals in your Personal Progression Plan
ga: Gheobhaidh tú comhairle agus tacaíocht leanúnach chun cabhrú leat na spriocanna atá i do Phlean Dul Chun Cinn Pearsanta a chomhlíonadh

source: If you do not keep to the steps agreed in the Record of Mutual Commitments and the conditions of your jobseeker’s payment, your payment can be reduced and eventually stopped altogether
ga: Mura leanann tú na bearta atá aontaithe i dTaifead na nGealltanas Frithpháirteach ná coinníollacha d’íocaíochta cuardaitheora poist, is féidir d’íocaíocht a laghdú agus deireadh a chur léi ina hiomláine

source: Visit welfare.ie to read Frequently Asked Questions about Intreo and Your Pathway to Work
ga: Tabhair cuairt ar welfare.ie chun Ceisteanna Coitianta faoi Intreo agus Do Chosán chun na hOibre a léamh

source: When you apply for Jobseeker’s Benefit or Jobseeker’s Allowance you must bring the correct documents with you
ga: Nuair a dhéanann tú iarratas ar Shochar Cuardaitheora Poist nó ar Liúntas Cuardaitheora Poist, ní mór duit na doiciméid chearta a thabhairt leat

source: Use our checklists to make sure you have the right documents
ga: Bain úsáid as ár seicliostaí chun deimhin a dhéanamh de go bhfuil na doiciméid chearta agat

source: • Checklist for Jobseeker’s Allowance
ga: • Seicliosta do Liúntas Cuardaitheora Poist

source: • Checklist for Jobseeker’s Benefit
ga: • Seicliosta do Shochar Cuardaitheora Poist

source: You must bring valid photographic identification (photo ID) or your Public Services Card with you to collect your payment
ga: Íocann an Roinn Coimirce Sóisialaí d’íocaíocht cuardaitheora poist ar bhonn seachtainiúil

source: Valid photo ID includes a driving licence, a passport or a GNIB card
ga: Nuair a fhaigheann tú d’íocaíocht cuardaitheora poist, íocfar méid sheachtainiúil i do chuntas bainc nó is féidir í a bhailiú ó Oifig an Phoist áitiúil

source: You must go to your Intreo Centre or Social Welfare Branch Office, usually every month, and declare you are still unemployed and looking for work
ga: Caithfear dul chuig d’Oifig Leasa Shóisialaigh Áitiúil gach mí go hiondúil agus deimhniú go bhfuil tú fós dífhostaithe agus ag cuardach oibre

source: You will be given a date and a time to sign on each month
ga: Tabharfaidh d’Oifig Leasa Shóisialaigh dáta agus am duit le síniú gach mí

source: In some cases you may sign on more or less frequently
ga: I gcásanna áirithe, d’fhéadfá síniú níos rialta nó le níos lú rialtachta

source: Usually if you live up to 10 miles from the nearest social welfare local office you will sign on every 4 weeks
ga: Go hiondúil, má chónaíonn tú suas go dtí 10 míle ón Oifig Leasa Shóisialaigh is cóngaraí, síneoidh tú gach 4 seachtain

source: If you live over 10 miles from the nearest social welfare local office you will sign on every 12 weeks
ga: Má chónaíonn tú os cionn 10 míle ón Oifig Leasa Shóisialaigh is cóngaraí, síneoidh tú gach 12 seachtain

source: People over 62 may not need to sign on every month
ga: D’fhéadfá a bheith incháilithe don Liúntas Leasa Forlíontach nuair atá tú ag feitheamh ar mheasúnú don íocaíocht cuardaitheora poist nó mura gcáilíonn tú don íocaíocht cuardaitheora poist

source: Supplementary Welfare Allowance provides a basic weekly allowance to eligible people who have little or no income
ga: Soláthraíonn an Liúntas Leasa Forlíontach bunliúntas seachtainiúil do dhaoine incháilithe atá ar bheagán ioncaim nó gan ioncam ar bith

source: If your weekly income is below the Supplementary Welfare Allowance rate for your family size, a payment may be made to bring your income up to the appropriate Supplementary Welfare Allowance rate
ga: Má tá d’ioncam seachtainiúil faoin ráta don Liúntas Leasa Forlíontach do mhéid an teaghlaigh atá agat, is féidir íocaíocht a dhéanamh a thabharfaidh d’ioncam chomh fada le ráta iomchuí Liúntais Leasa Forlíontaigh

source: If you get Jobseeker’s Allowance or Jobseeker’s Benefit or Supplementary Welfare Allowance you may be entitled to other social welfare and health benefits
ga: Má fhaigheann tú Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist nó Liúntas Leasa Forlíontach, d’fhéadfá a bheith incháilithe do shochair leasa shóisialaigh agus sláinte eile freisin

source: If your income is below a certain amount you may get a medical card or a GP visit card
ga: Má thiteann d’ioncam faoi bhun méid áirithe, d’fhéadfá Cárta Leighis nó Cárta Cuairte DG a fháil

source: If you are in local authority housing you should contact your local authority and ask for a review of your rent
ga: D’fhéadfá cúnamh le haisíocaíochtaí úis mhorgáiste a fháil nó cúnamh le cíos a íoc

source: You may get help with the cost of uniforms and footwear for your children
ga: D’fhéadfá cúnamh a fháil le costas éadaí agus coisbhirt do leanaí scoile

source: The Back to School Clothing and Footwear Allowance Scheme operates from 1 June to 30 September each year
ga: Feidhmíonn an Scéim Liúntais Éadaí agus Coisbhirt don Scoilbhliain Nua ón 1 Meitheamh go dtí an 30 Meán Fómhair gach bliain

source: Visit welfare.ie for contact details. Where to apply
ga: Riachtanais eisceachtúla agus phráinneacha

source: You apply for Jobseeker's Benefit or Jobseeker's Allowance to your Intreo Centre or Social Welfare Branch Office
ga: Má tá riachtanas eisceachtúil nó práinneach agat, mar shampla cúnamh le bille sochraide, tá raon íocaíochtaí lánroghnacha soláthraithe ag an Oifigeach Leasa Pobail i d'ionad sláinte áitiúil
